<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558

In [12]:
df.to_numpy()

array([[ 0.74693558, -0.3649359 , -0.273926  , -0.99455639],
       [-0.58249288, -0.03199402, -0.190693  ,  0.79993212],
       [-0.01847547,  1.02814372, -0.41428564,  0.59656451],
       [-0.38910759, -0.02893694,  1.02907724,  0.10937912],
       [ 0.2256923 ,  1.71208469, -0.93613562,  0.71082931],
       [-0.42792149, -1.17073213, -0.52416344, -0.11155783]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.746936   -0.582493   -0.018475   -0.389108    0.225692   -0.427921
B   -0.364936   -0.031994    1.028144   -0.028937    1.712085   -1.170732
C   -0.273926   -0.190693   -0.414286    1.029077   -0.936136   -0.524163
D   -0.994556    0.799932    0.596565    0.109379    0.710829   -0.111558

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.994556 -0.273926 -0.364936  0.746936
2013-01-02  0.799932 -0.190693 -0.031994 -0.582493
2013-01-03  0.596565 -0.414286  1.028144 -0.018475
2013-01-04  0.109379  1.029077 -0.028937 -0.389108
2013-01-05  0.710829 -0.936136  1.712085  0.225692
2013-01-06 -0.111558 -0.524163 -1.170732 -0.427921

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-05  0.225692  1.712085 -0.936136  0.710829

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01    0.746936
2013-01-02   -0.582493
2013-01-03   -0.018475
2013-01-04   -0.389108
2013-01-05    0.225692
2013-01-06   -0.427921
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A    0.746936
B   -0.364936
C   -0.273926
D   -0.994556
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.746936 -0.364936
2013-01-02 -0.582493 -0.031994
2013-01-03 -0.018475  1.028144
2013-01-04 -0.389108 -0.028937
2013-01-05  0.225692  1.712085
2013-01-06 -0.427921 -1.170732

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02 -0.582493 -0.031994
2013-01-03 -0.018475  1.028144
2013-01-04 -0.389108 -0.028937

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A   -0.582493
B   -0.031994
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

0.7469355847023106

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

0.7469355847023106

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A   -0.389108
B   -0.028937
C    1.029077
D    0.109379
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.389108 -0.028937
2013-01-05  0.225692  1.712085

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.582493 -0.190693
2013-01-03 -0.018475 -0.414286
2013-01-05  0.225692 -0.936136

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.364936 -0.273926
2013-01-02 -0.031994 -0.190693
2013-01-03  1.028144 -0.414286
2013-01-04 -0.028937  1.029077
2013-01-05  1.712085 -0.936136
2013-01-06 -1.170732 -0.524163

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

-0.03199401794801987

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

-0.03199401794801987

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-05  0.225692  1.712085 -0.936136  0.710829

In [37]:
df

                   A         B         C         D
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932
2013-01-03 -0.018475  1.028144 -0.414286  0.596565
2013-01-04 -0.389108 -0.028937  1.029077  0.109379
2013-01-05  0.225692  1.712085 -0.936136  0.710829
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01  0.746936       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN  0.799932
2013-01-03       NaN  1.028144       NaN  0.596565
2013-01-04       NaN       NaN  1.029077  0.109379
2013-01-05  0.225692  1.712085       NaN  0.710829
2013-01-06       NaN       NaN       NaN       NaN

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556    one
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932    one
2013-01-03 -0.018475  1.028144 -0.414286  0.596565    two
2013-01-04 -0.389108 -0.028937  1.029077  0.109379  three
2013-01-05  0.225692  1.712085 -0.936136  0.710829   four
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -0.018475  1.028144 -0.414286  0.596565   two
2013-01-05  0.225692  1.712085 -0.936136  0.710829  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01  0.746936 -0.364936 -0.273926 -0.994556  NaN
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932  1.0
2013-01-03 -0.018475  1.028144 -0.414286  0.596565  2.0
2013-01-04 -0.389108 -0.028937  1.029077  0.109379  3.0
2013-01-05  0.225692  1.712085 -0.936136  0.710829  4.0
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.364936 -0.273926 -0.994556  NaN
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932  1.0
2013-01-03 -0.018475  1.028144 -0.414286  0.596565  2.0
2013-01-04 -0.389108 -0.028937  1.029077  0.109379  3.0
2013-01-05  0.225692  1.712085 -0.936136  0.710829  4.0
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.273926 -0.994556  NaN
2013-01-02 -0.582493 -0.031994 -0.190693  0.799932  1.0
2013-01-03 -0.018475  1.028144 -0.414286  0.596565  2.0
2013-01-04 -0.389108 -0.028937  1.029077  0.109379  3.0
2013-01-05  0.225692  1.712085 -0.936136  0.710829  4.0
2013-01-06 -0.427921 -1.170732 -0.524163 -0.111558  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.273926  5  NaN
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0
2013-01-03 -0.018475  1.028144 -0.414286  5  2.0
2013-01-04 -0.389108 -0.028937  1.029077  5  3.0
2013-01-05  0.225692  1.712085 -0.936136  5  4.0
2013-01-06 -0.427921 -1.170732 -0.524163  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.273926 -5  NaN
2013-01-02 -0.582493 -0.031994 -0.190693 -5 -1.0
2013-01-03 -0.018475 -1.028144 -0.414286 -5 -2.0
2013-01-04 -0.389108 -0.028937 -1.029077 -5 -3.0
2013-01-05 -0.225692 -1.712085 -0.936136 -5 -4.0
2013-01-06 -0.427921 -1.170732 -0.524163 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.273926  5  NaN  1.0
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0  1.0
2013-01-03 -0.018475  1.028144 -0.414286  5  2.0  NaN
2013-01-04 -0.389108 -0.028937  1.029077  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.273926  5  5.0  1.0
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0  1.0
2013-01-03 -0.018475  1.028144 -0.414286  5  2.0  5.0
2013-01-04 -0.389108 -0.028937  1.029077  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.273926  5  NaN  1.0
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0  1.0
2013-01-03 -0.018475  1.028144 -0.414286  5  2.0  NaN
2013-01-04 -0.389108 -0.028937  1.029077  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.273926  5  NaN
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0
2013-01-03 -0.018475  1.028144 -0.414286  5  2.0
2013-01-04 -0.389108 -0.028937  1.029077  5  3.0
2013-01-05  0.225692  1.712085 -0.936136  5  4.0
2013-01-06 -0.427921 -1.170732 -0.524163  5  5.0

In [54]:
df.mean()

A   -0.198718
B    0.251428
C   -0.218354
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    1.181519
2013-01-02    1.038964
2013-01-03    1.519077
2013-01-04    1.722207
2013-01-05    2.000328
2013-01-06    1.575437
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [57]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.018475  0.028144 -1.414286  4.0  1.0
2013-01-04 -3.389108 -3.028937 -1.970923  2.0  0.0
2013-01-05 -4.774308 -3.287915 -5.936136  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.273926  5  NaN
2013-01-02 -0.582493 -0.031994 -0.190693  5  1.0
2013-01-03 -0.018475  1.028144 -0.414286  5  2.0
2013-01-04 -0.389108 -0.028937  1.029077  5  3.0
2013-01-05  0.225692  1.712085 -0.936136  5  4.0
2013-01-06 -0.427921 -1.170732 -0.524163  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.273926   5   NaN
2013-01-02 -0.582493 -0.031994 -0.464619  10   1.0
2013-01-03 -0.600968  0.996150 -0.878905  15   3.0
2013-01-04 -0.990076  0.967213  0.150173  20   6.0
2013-01-05 -0.764384  2.679297 -0.785963  25  10.0
2013-01-06 -1.192305  1.508565 -1.310126  30  15.0

In [60]:
df.apply(lambda x : x.max() - x.min())

A    0.808185
B    2.882817
C    1.965213
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [61]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    3
1    6
2    5
3    2
4    3
5    1
6    6
7    3
8    2
9    5
dtype: int64

In [62]:
s.value_counts()

3    3
6    2
5    2
2    2
1    1
dtype: int64

# String Methods

In [63]:
s = pd.Series(['A', "B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge(병합)

## Concat

pandas는 Series와 DataFrame 객체를 쉽게 결합할 수 있는 다양한 기능을 제공합니다.

Join, Merge 연산의 경우 index와 관계 대수를 위한 다양한 로직을 제공합니다.

In [64]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -1.875605  0.138367  0.694521 -0.095246
1  0.780112  0.487579 -0.666332 -0.472608
2  0.248429  0.316233  0.892239 -0.223900
3  1.007335  0.561399  0.101845 -1.810836
4  1.041486 -0.364609  2.219587  0.191442
5  0.047837 -0.243075 -0.253931  0.520684
6  0.197476  1.673919  2.820898  0.082690
7 -1.461990 -2.482931  0.712551  1.900606
8 -0.194426 -0.007072 -0.151809  0.756018
9  0.131908 -1.855663  0.473915 -1.437969

In [65]:
pieces = [df[:3], df[3:7],df[7:]]
pieces

[          0         1         2         3
 0 -1.875605  0.138367  0.694521 -0.095246
 1  0.780112  0.487579 -0.666332 -0.472608
 2  0.248429  0.316233  0.892239 -0.223900,
           0         1         2         3
 3  1.007335  0.561399  0.101845 -1.810836
 4  1.041486 -0.364609  2.219587  0.191442
 5  0.047837 -0.243075 -0.253931  0.520684
 6  0.197476  1.673919  2.820898  0.082690,
           0         1         2         3
 7 -1.461990 -2.482931  0.712551  1.900606
 8 -0.194426 -0.007072 -0.151809  0.756018
 9  0.131908 -1.855663  0.473915 -1.437969]

In [66]:
pd.concat(pieces)

          0         1         2         3
0 -1.875605  0.138367  0.694521 -0.095246
1  0.780112  0.487579 -0.666332 -0.472608
2  0.248429  0.316233  0.892239 -0.223900
3  1.007335  0.561399  0.101845 -1.810836
4  1.041486 -0.364609  2.219587  0.191442
5  0.047837 -0.243075 -0.253931  0.520684
6  0.197476  1.673919  2.820898  0.082690
7 -1.461990 -2.482931  0.712551  1.900606
8 -0.194426 -0.007072 -0.151809  0.756018
9  0.131908 -1.855663  0.473915 -1.437969

## Join

SQL 스타일로 병합이 됩니다.

In [71]:
left = pd.DataFrame({"key" :["foo","foo"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [72]:
right = pd.DataFrame({"key" :["foo","foo"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [73]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

다른 예를 보자면

In [74]:
left = pd.DataFrame({"key" : ["foo","bar"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  bar     2

In [75]:
right = pd.DataFrame({"key" :["foo","bar"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  bar     5

In [76]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5